In [33]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

print(pd.__version__)
print(np.__version__)

1.5.2
1.23.5

**Prefix dan Suffix pada seluruh Kolom Pandas Data Frame**

- prefix menambahkan string di depan string
- suffix menambahkan string di belakang string

In [3]:
x_rows = 5
x_cols = 5
cols = tuple('ABCDE') #untuk penamaan label kolom

#membuat table dengan isi angka random
df = pd.DataFrame(np.random.randint(1, 10, size =(x_rows, x_cols)), columns = cols)
df

   A  B  C  D  E
0  4  9  7  8  5
1  9  2  9  2  1
2  4  5  2  5  8
3  4  7  3  7  3
4  7  4  8  4  5

**prefix**

In [14]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        6        9        9        2
1        7        6        2        4        6
2        2        1        4        4        6
3        8        9        8        1        8
4        3        4        8        7        1

**suffix**

In [15]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        4        6        9        9        2
1        7        6        2        4        6
2        2        1        4        4        6
3        8        9        8        1        8
4        3        4        8        7        1

**Pemilihan baris (rows selection) pada Data Frame**

In [4]:
a_rows = 11
a_cols = 6
cols = tuple('ABCDEF')

#membuat table dengan isi angka random
df = pd.DataFrame(np.random.randint(10, 20, size =(a_rows, a_cols)), columns = cols)
df

     A   B   C   D   E   F
0   13  19  17  13  19  19
1   16  18  15  10  16  10
2   12  13  17  10  16  16
3   11  19  10  16  18  17
4   15  15  16  16  18  17
5   14  19  12  18  12  18
6   16  14  18  12  11  16
7   19  18  19  14  18  18
8   17  17  13  17  10  18
9   18  19  12  17  12  11
10  14  17  15  17  10  15

Selection dengan fungsi **isin()**

ini sama dengan penggunaan operator logika or (|)

In [5]:
#mencari angka 12 dan 17 pada kolom A
df[df['A'].isin([12, 17])]

    A   B   C   D   E   F
2  12  13  17  10  16  16
8  17  17  13  17  10  18

Operator negasi (~) berguna untuk mencari nilai yang tidak sama

In [21]:
#mencari angka selain 12 dan 17 pada kolom A
df[~df['A'].isin([12, 17])]

     A   B   C   D   E   F
0   15  13  11  13  18  11
3   11  17  14  16  16  18
4   14  19  12  10  12  19
5   13  18  13  14  12  16
8   13  12  11  18  13  15
9   11  10  15  15  11  19
10  10  16  12  11  12  18

**Konversi tipe data String ke Numerik pada kolom Data Frame**

In [9]:
data = {
    'col_a' : ['1', '2', '3', 'teks'],
    'col_b' : ['1', '2', '3', '4']
}

ds = pd.DataFrame(data)
ds

  col_a col_b
0     1     1
1     2     2
2     3     3
3  teks     4

In [10]:
ds.info() #menggunakan ini, informasi mengenai datanya lebih lengkap

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_a   4 non-null      object
 1   col_b   4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [11]:
ds.dtypes #jika menggunakan ini hanya menampilkan type data dari setiap kolomnya

col_a    object
col_b    object
dtype: object

Konversi tipe data dengan fungsi **astype()** pada satu kolom saja

In [18]:
ds_1 = ds.astype({'col_b':'int'}) #int (integer), float, object
ds_1

  col_a  col_b
0     1      1
1     2      2
2     3      3
3  teks      4

In [19]:
ds_1.dtypes

col_a    object
col_b     int32
dtype: object

Konversi tipe data numerik dengan fungsi **to_numeric()**

penggunaan fungsi ini jika kita ingin konversi data ke data numeric kekeseluruhan data frame.

In [23]:
ds_1.apply(pd.to_numeric, errors = 'coerce') #kegunaan parameter coerce jika kita menemukan atau terdapat data yang tidak bisa diubah ke data numeric, data tersebut akan dianggap/diubah menjadi NaN atau dianggap sebagai missing value.

   col_a  col_b
0    1.0      1
1    2.0      2
2    3.0      3
3    NaN      4

**Pemilihan kolom (columns selection) berdasarkan tipe data**

In [34]:
rows_x = 5
cols_y = 2
cols1 = ['bil_pecahan', 'bil_bulat']

dst = pd.DataFrame(np.random.randint(10, 20, size = (rows_x, cols_y)), columns = cols1)

dst['bil_pecahan'] = dst['bil_pecahan'].astype('float')

dst.index = pd.util.testing.makeDateIndex(rows_x, freq = 'H')
dst = dst.reset_index()

dst['teks'] = list('ABCDE')

dst

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         19.0         19    A
1 2000-01-01 01:00:00         14.0         15    B
2 2000-01-01 02:00:00         13.0         19    C
3 2000-01-01 03:00:00         14.0         19    D
4 2000-01-01 04:00:00         14.0         18    E